package bot;

import static bot.Properties.*;
import static bot.database.Settings.getCount;
import static com.radik.Radik.SERVER;

public class Text {
    public static final String LAW = """
            *Правовая информация о продукте RadikBOT*
           
            Согласно федеральному закону от *27.07.2006 N 152-ФЗ "О персональных данных"*:
            - Владелец RadikBOT и RadikCore *НЕ* имеет право на распространение полученной конфиденциальной информации пользователей (пароли, ip адреса), а также её использование в других целях.
            - Обязан получить разрешение на использование подобной информации у пользователя.
            - Обязан предоставить список получаемой информации, извлекаемой у пользователя по его просьбе.
            - Имеет право собирать и указывать анонимную статистику собираемых данных.
           
            Данный текст вступил в силу от 20.11.2024г и действует по 20.11.2025г
           """;

    public static final String SERVER_INFO2 = String.format("""
                Полная информация о сервере RadikBOT.
            
            Продукт: *RadikBOT*
            Используется для: *RadikCore*
            Версия проекта: *%s*
            Поддерживаемые языки: *Ru*
            Разработчик: *Radik*
            Тестировщики: *Radik*, *Abobusniev*
            Последняя дата обновления: *%s*
            Всего пользователей: *%d*
            Написан на: *Java23*
            Проекты в которых используется: *PupsikiSurvival 3*, *Radik SkyBlock*
            
            Игроков на сервере: *%d*
            
            Версия мода: *%s*
            Версия игры: *%s*
            Айпи сервера: *%s*
            Альтернативный айпи: *%s*
            
                *CREDITS*
            дискорд: *rad_ik*
            телеграм: *@Rad1k2*
            """, SERVER_VERSION, LAST_UPDATE, getCount("Registered"), SERVER.getCurrentPlayerCount(), CLIENT_VERSION, MINECRAFT_VERSION, SERVER_IP, ALTERNATIVE_IP);

    public static final String SERVER_INFO1 = String.format("""
            Это серверный раздел RadikBOT.
            
            Некоторая информация:
            Проект: *RadikCore*
            Версия проекта: *%s*
            Разработчик: *Radik*
            
            Для получения большей информации нажми "*Информация о сервере*"
            """, SERVER_VERSION);

    public static final String COMMANDS = """
            *Команды RadikBOT*
            
            /start
            /register
            /login
            
            Конечно, основной функционал бота написан на инлайн-кнопках. Но есть некоторые команды, которые просто необходимы.
            """;

    public static final String CLIENT_FUNCTIONAL = """
            *Обработка сообщений* - я обрабатываю все твои сообщения, как в телеграмме, так и в майнкрафте. Это нужно для корректной работы и передачи информации между серверами. Не беспокойся! Я не сохраняю твои сообщения.
            
            *Получение данных* - я получаю только те данные, которые мне необходимы для правильной работы (ip адреса, id аккаунтов телеграмм, UUID в майнкрафт и прочее). Я не распространяю информацию никому! Даже моему владельцу.
            
            *Обработка нажатий* - я обрабатываю все нажатия на мои кнопки. Это нужно, чтобы я смог понять, что ты хочешь видеть! Я не получаю никакой информации кроме той, какую кнопку ты нажимаешь.
            """;

    public static final String SERVER_FUNCTIONAL = """
            *Триггер входа на сервер* - когда кто-то входит на сервер, я сразу понимаю это. Это необходимо для твоей безопасности и безопасности сервера. Я защищаю нас от злоумышленников!
            
            *Триггер ломания блоков* - при ломании блока я получаю всю нужную информацию. пока что это нигде не используется, но, думаю, скоро это изменится!
            """;
}
